openfoam/OpenFOAM-dev/tutorials/incompressibleFluid/TJunctionFan/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    baffle;
        type    faceZoneSet;
        action  new;
        source  planeToFaceZone;
        point   (0.1 0 0);
        normal  (1 0 0);
    }
    {
        name    fan;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        surface searchablePlate;
        origin  (0.1 -0.006 0.004);
        span    (0 0.012 0.012);
    }
    {
        name    baffle;
        type    faceZoneSet;
        action  delete;
        source  faceZoneToFaceZone;
        zone    fan;
    }
);

// ************************************************************************* //
